In [1]:
import pandas as pd
import numpy as np

In [7]:
df= pd.DataFrame({
    'city': ['delhi', 'pune', 'mumbai', 'banglore', 'mumbai', 'pune', 'paris'],
    'price':[130,145,150,156,150,170,135]
})

In [8]:
df.head()

       city  price
0     delhi    130
1      pune    145
2    mumbai    150
3  banglore    156
4    mumbai    150

In [11]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [12]:
df['city_encoded']= df['city'].map(mean_price)

In [13]:
df.head()

       city  price  city_encoded
0     delhi    130         130.0
1      pune    145         157.5
2    mumbai    150         150.0
3  banglore    156         156.0
4    mumbai    150         150.0

In [38]:
df.drop('city', axis=1)

   price  city_encoded
0    130    145.658047
1    145    149.347585
2    150    148.283702
3    156    149.040868
4    150    148.283702
5    170    149.347585
6    135    146.308590

In [21]:
df= pd.concat([df['city_encoded'], df['city']],axis=1)

In [19]:
df.head()

   city_encoded      city
0         130.0     delhi
1         157.5      pune
2         150.0    mumbai
3         156.0  banglore
4         150.0    mumbai

In [33]:
df.head()

       city  price  city_encoded
0     delhi    130    145.658047
1      pune    145    149.347585
2    mumbai    150    148.283702
3  banglore    156    149.040868
4    mumbai    150    148.283702

## using python library

In [29]:
df2= pd.DataFrame({
    'city': ['delhi', 'pune', 'mumbai', 'banglore', 'mumbai', 'pune', 'paris'],
    'price':[130,145,150,156,150,170,135]
})

In [24]:
pip install category_encoders

Collecting category_encoders
  Downloading category_encoders-2.8.1-py3-none-any.whl.metadata (7.9 kB)
Requirement already satisfied: numpy>=1.14.0 in /opt/homebrew/anaconda3/lib/python3.12/site-packages (from category_encoders) (1.26.4)
Requirement already satisfied: pandas>=1.0.5 in /opt/homebrew/anaconda3/lib/python3.12/site-packages (from category_encoders) (2.2.3)
Requirement already satisfied: patsy>=0.5.1 in /opt/homebrew/anaconda3/lib/python3.12/site-packages (from category_encoders) (0.5.6)
Collecting scikit-learn>=1.6.0 (from category_encoders)
  Downloading scikit_learn-1.7.1-cp312-cp312-macosx_12_0_arm64.whl.metadata (11 kB)
Requirement already satisfied: scipy>=1.0.0 in /opt/homebrew/anaconda3/lib/python3.12/site-packages (from category_encoders) (1.13.1)
Requirement already satisfied: statsmodels>=0.9.0 in /opt/homebrew/anaconda3/lib/python3.12/site-packages (from category_encoders) (0.14.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/homebrew/anaconda3/lib/python3.12/site-packages (from pandas>=1.0.5->category_encoders) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/homebrew/anaconda3/lib/python3.12/site-packages (from pandas>=1.0.5->category_encoders) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /opt/homebrew/anaconda3/lib/python3.12/site-packages (from pandas>=1.0.5->category_encoders) (2023.3)
Requirement already satisfied: six in /opt/homebrew/anaconda3/lib/python3.12/site-packages (from patsy>=0.5.1->category_encoders) (1.16.0)
Requirement already satisfied: joblib>=1.2.0 in /opt/homebrew/anaconda3/lib/python3.12/site-packages (from scikit-learn>=1.6.0->category_encoders) (1.4.2)
Requirement already satisfied: threadpoolctl>=3.1.0 in /opt/homebrew/anaconda3/lib/python3.12/site-packages (from scikit-learn>=1.6.0->category_encoders) (3.5.0)
Requirement already satisfied: packaging>=21.3 in /opt/homebrew/anaconda3/lib/python3.12/site-packages (from statsmodels>=0.9.0->category_encoders) (24.1)
Downloading category_encoders-2.8.1-py3-none-any.whl (85 kB)
Downloading scikit_learn-1.7.1-cp312-cp312-macosx_12_0_arm64.whl (8.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 8.6/8.6 MB 2.1 MB/s eta 0:00:00a 0:00:01
Installing collected packages: scikit-learn, category_encoders
  Attempting uninstall: scikit-learn
    Found existing installation: scikit-learn 1.5.1
    Uninstalling scikit-learn-1.5.1:
      Successfully uninstalled scikit-learn-1.5.1
Successfully installed category_encoders-2.8.1 scikit-learn-1.7.1
Note: you may need to restart the kernel to use updated packages.

In [26]:
import category_encoders as ce

In [34]:
encoder= ce.TargetEncoder(cols=['city'],smoothing=0)
df2['city_encoded'] = encoder.fit_transform(df2['city'], df2['price'])

In [35]:
df2.head()

       city  price  city_encoded
0     delhi    130         148.0
1      pune    145         148.0
2    mumbai    150         148.0
3  banglore    156         148.0
4    mumbai    150         148.0

In [37]:
df.head()

       city  price  city_encoded
0     delhi    130    145.658047
1      pune    145    149.347585
2    mumbai    150    148.283702
3  banglore    156    149.040868
4    mumbai    150    148.283702